# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Utilities
brew 'ack'
brew 'awscli'
brew 'coreutils'
brew 'git'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'openssl'
brew 'readline'
brew 'trash'
brew 'wget'
brew 'wifi-password'

# Database
brew 'postgresql'
brew 'mariadb'

brew 'nvm'
brew 'node'
brew 'ruby'

# Apps
cask 'aerial'
cask 'atom'
cask 'caffeine'
cask 'cheatsheet'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'forklift'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'mysqlworkbench'
cask 'rescuetime'
cask 'sequel-pro'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'textual'
cask 'tunnelbear'
cask 'vagrant'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'